"""
字典可以基于key检索value，就像查字典一样
字典中key和value可以为任意类型，但key不能是字典
key不允许重复，重复会覆盖原有的数据
不能通过下标索引，只能通过key来检索value
"""

# 定义字典
dict1 = {'张三': 183, '李四': 182, '王五': 181}
print(f'字典定义{dict1},类型{type(dict1)}')
# 定义空字典
dict2 = {}
dict3 = dict()
print(f'空字典{dict2}{dict3},类型为{type(dict2)}{type(dict3)}')
# 基于key来寻找value
print(f'张三的身高{dict1["张三"]}')
# 定义嵌套字典
score = {
    '张三': {
        '语文': 78,
        '数学': 89,
        '英语': 80
    },
    '李四': {
        '语文': 78,
        '数学': 89,
        '英语': 80
    },
    '王五': {
        '语文': 78,
        '数学': 89,
        '英语': 80
    },
}
# 从嵌套字典中获取数据
print(f'张三的语文成绩是{score['张三']['语文']}')
print(f'李四的各项成绩是{score['李四']}')
