mem = {
    '张三': {
        '部门': '科技部', '工资': 3000, '级别': 1
    },
    '李四': {
        '部门': '市场部', '工资': 5000, '级别': 2
    },
    '王五': {
        '部门': '市场部', '工资': 7000, '级别': 3
    },
    '赵六': {
        '部门': '科技部', '工资': 4000, '级别': 1
    },
    '钱七': {
        '部门': '市场部', '工资': 6000, '级别': 2
    }
}
print('全体员工当前信息如下：')
for k in mem:
    print(f'{k}: {mem[k]}')

for k in mem:
    if mem[k]['级别'] == 1:
        mem[k]['级别'] += 1
        mem[k]['工资'] += 1000
print('全体级别为1级的员工升职加薪后：')
for k in mem:
    print(f'{k}: {mem[k]}')
